app/views/games/new.erb

    <%= f.label "Choose your fighter: "%>
    <%= f.collection_select :player_character_id, Character.all, :id, :name, {}, {:class=>'char_sel'} %>
---
SELECT "characters".* FROM "characters"