app/controllers/battles_controller.rb

  def create

    @battle = Battle.new(
      player_character_id: params[:game][:player_id].to_i,
      enemy_character_id: params[:game][:enemy_id].to_i,
      attack: params[:attack]
    )
    byebug
    @battle.save
---
INSERT INTO "battles" ("attack", "created_at", "updated_at", "game_id", "player_character_id", "enemy_character_id") VALUES (?, ?, ?, ?, ?, ?)  [["attack", "punch"], ["created_at", "2018-03-06 21:34:03.831296"], ["updated_at", "2018-03-06 21:34:03.831296"], ["game_id", 98], ["player_character_id", 1], ["enemy_character_id", 1]]

  def show
    @battle = Battle.find(params[:id])
---
SELECT  "battles".* FROM "battles" WHERE "battles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]