app/controllers/characters_controller.rb

INSERT INTO "characters" ("name", "height", "weight", "speed", "strength", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @character = Character.create(character_params)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_character
    @character = Character.find(params[:id])