app/controllers/games_controller.rb

INSERT INTO "games" ("user_id", "created_at", "updated_at", "player_character_id", "enemy_character_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 7], ["created_at", "2018-03-06 17:40:20.394724"], ["updated_at", "2018-03-06 17:40:20.394724"], ["player_character_id", 1], ["enemy_character_id", 1]]
---
  def create
    @game = Game.new(game_params)
    @game.user_id = session[:user_id]
    @game.get_player_character.update(health: 100)
    @game.get_enemy_character.update(health: 100)
    @game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def round1
    @game = Game.find(params[:id])