app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "scott"], ["password_digest", "$2a$10$yGu.qeef0NRQN578Kd7w8eL.ruk0Lc4cCHg8OXZd95fX.WHFCE8pG"], ["created_at", "2018-03-05 20:55:10.586325"], ["updated_at", "2018-03-05 20:55:10.586325"]]